# MissingCurrentConstraintForHandle Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..MissingCurrentConstraintForHandle Property
BuiltInFailures..::..RebarFailures Class See Also
---
The current handle has no constraint. Please select a valid target to apply a new constraint.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MissingCurrentConstraintForHandle { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MissingCurrentConstraintForHandle As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MissingCurrentConstraintForHandle {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace